Торговля_11__демо/src/InformationRegisters/ОбновляемыеРезультатыОтчетов/ОбновляемыеРезультатыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбновляемыеРезультатыОтчетов</name>
  <resources>
    <name>РезультатОтчета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ПользовательскаяНастройка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОбновленияОтчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отчет</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вариант</name>
    <type>
      <types>CatalogRef.ДашбордыМЦП</types>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешПользовательскойНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/InformationRegisters/ОбновляемыеРезультатыОтчетов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтруктураЗаписи = Неопределено;
	Если Не Параметры.Свойство("СтруктураЗаписи", СтруктураЗаписи) Тогда
		РегистрыСведений.ОбновляемыеРезультатыОтчетов.СообщитьПользователю(НСтр(
			"ru = 'Просмотр офлайн отчета доступен только из списка офлайн отчетов!'"), Отказ);
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураЗаписи);

	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.ОбновляемыеРезультатыОтчетов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Параметры.СтруктураЗаписи);
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		РегистрыСведений.ОбновляемыеРезультатыОтчетов.СообщитьПользователю(НСтр(
			"ru = 'Не найдена запись по указанным параметрам!'"), Отказ);
	ИначеЕсли Запись.ОшибкаОбновленияОтчета Тогда
		РегистрыСведений.ОбновляемыеРезультатыОтчетов.СообщитьПользователю(НСтр(
			"ru = 'Результат отчета не был сформирован!'"), Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	РезультатОтчета = Запись.РезультатОтчета.Получить();
	Если ТипЗнч(РезультатОтчета) = Тип("ТабличныйДокумент") Тогда
		ТабДокумент.Вывести(РезультатОтчета);
	Иначе
		РегистрыСведений.ОбновляемыеРезультатыОтчетов.СообщитьПользователю(НСтр(
			"ru = 'Ошибка при чтении результата отчета - некорректные данные'"), Отказ);
	КонецЕсли;

	Если Не Отказ Тогда
		Запись.ДатаПоследнегоПросмотра = ТекущаяДатаСеанса();
		Запись.Записать();
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
